docs/posts/2023-01-25-org-mode-footnotes-in-hugo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Mode Footnotes in Hugo</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Org Mode Footnotes in Hugo</h1>
<p class="subtitle" role="doc-subtitle">Jan 25, 2023</p>
</header><p>
I mentioned yesterday that I couldn&rsquo;t remember what I didn&rsquo;t like about Hugo&rsquo;s parsing of Org mode in the past. When I viewed the published post, I quickly remembered what it was: footnotes. If I remember correctly, at the time that I first tried using native Org mode parsing, Hugo didn&rsquo;t parse the footnotes at all. Now, it does, but they render in an odd way. The footnote number is in subscript on one line, followed by a blank line, followed by the footnote text on another line. So, instead of getting something like this:
</p>

<pre class="example">
1. Footnote text.
</pre>

<p>
We get this:
</p>

<pre class="example">
1.

Footnote text.
</pre>

<p>
A Google search resulted in one question on the <a href="https://discourse.gohugo.io/t/footnotes-rendered-different-for-org-files-compared-to-markdown-source/20415/">Hugo help forum</a>, but no good answer. The problem is the way that Hugo renders the HTML. In a Markdown post, this content
</p>

<div class="org-src-container">
<pre class="src src-markdown">This is a footnote test.[^1]

[^1]: Footnote content.
</pre>
</div>

<p>
results in this HTML code:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;div class="article-post"&gt;
    &lt;p&gt;This is a footnote test.&lt;sup id="fnref:1"&gt;&lt;a href="#fn:1" class="footnote-ref" role="doc-noteref"&gt;1&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;
    &lt;div class="footnotes" role="doc-endnotes"&gt;
        &lt;hr&gt;
        &lt;ol&gt;
            &lt;li id="fn:1"&gt;
                &lt;p&gt;Footnote content.&amp;#160;&lt;a href="#fnref:1" class="footnote-backref" role="doc-backlink"&gt;&amp;#x21a9;&amp;#xfe0e;&lt;/a&gt;&lt;/p&gt;
            &lt;/li&gt;
        &lt;/ol&gt;
    &lt;/div&gt;

&lt;/div&gt;
</pre>
</div>

<p>
This turns the footnotes into numbered list items that end with a nice return character that is linked to the footnote number in the text.
</p>

<p>
This Org mode content, however,
</p>

<div class="org-src-container">
<pre class="src src-org">This is a footnote test.[fn:1]

[fn:1] Footnote content. 
</pre>
</div>

<p>
renders like this:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;div class="article-post"&gt;
    &lt;p&gt;
        This is a footnote test.&lt;sup class="footnote-reference"&gt;&lt;a id="footnote-reference-1" href="#footnote-1"&gt;1&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;
    &lt;div class="footnotes"&gt;
        &lt;hr class="footnotes-separatator"&gt;
        &lt;div class="footnote-definitions"&gt;
            &lt;div class="footnote-definition"&gt;
                &lt;sup id="footnote-1"&gt;&lt;a href="#footnote-reference-1"&gt;1&lt;/a&gt;&lt;/sup&gt;
                &lt;div class="footnote-body"&gt;
                    &lt;p&gt;Footnote content. &lt;/p&gt;
                &lt;/div&gt;
            &lt;/div&gt;
        &lt;/div&gt;
    &lt;/div&gt;

&lt;/div&gt;
</pre>
</div>

<p>
Notice that there is no list, instead the footnote text is separated from the number by a <code>&lt;div&gt;</code>, which is normally rendered as an empty line.
</p>

<p>
Hacking around with some CSS, I managed to get the number and the text on the same line.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> Here&rsquo;s the CSS code:
</p>

<div class="org-src-container">
<pre class="src src-css">.footnote-definition {
  display: block;
}

.footnote-body {
  display: inline-block;
}
</pre>
</div>



<p>
I&rsquo;m not quite satisfied with the superscript number in the footnote, but I haven&rsquo;t found a good fix for that yet.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Like this. 
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
